# Chapter 8. Date Arithmetic

In [1]:
%load_ext sql
%sql postgresql://sql-cookbook:sql-cookbook@0.0.0.0:5432/sql-cookbook

## 8.1 Adding and Subtracting Days, Months, and Years

In [2]:
%%sql
select to_char(hiredate - 5, 'DD-MON-YYYY')                    as hd_minus_5d,
       to_char(hiredate + 5, 'DD-MON-YYYY')                    as hd_plus_5d,
       to_char(hiredate - '5 months'::interval, 'DD-MON-YYYY') as hd_minus_5m,
       to_char(hiredate + '5 months'::interval, 'DD-MON-YYYY') as hd_plus_5m,
       to_char(hiredate - '5 years'::interval, 'DD-MON-YYYY')  as hd_minus_5y,
       to_char(hiredate + '5 years'::interval, 'DD-MON-YYYY')  as hd_plus_5y
from emp
where deptno = 10;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
3 rows affected.

[('04-JUN-2006', '14-JUN-2006', '09-JAN-2006', '09-NOV-2006', '09-JUN-2001', '09-JUN-2011'),
 ('12-NOV-2006', '22-NOV-2006', '17-JUN-2006', '17-APR-2007', '17-NOV-2001', '17-NOV-2011'),
 ('18-JAN-2007', '28-JAN-2007', '23-AUG-2006', '23-JUN-2007', '23-JAN-2002', '23-JAN-2012')]

## 8.2 Determining the Number of Days Between Two Dates

In [3]:
%%sql
select max(hiredate) - min(hiredate) as hiredate_span_days
from emp
where ename ~ '(?i)allen|ward';

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
1 rows affected.

[(2,)]

## 8.3 Determining the Number of Business Days Between Two Dates

In [4]:
%%sql
with hiredates as (
    select min(hiredate) as min_hiredate,
           max(hiredate) as max_hiredate
    from emp
    where ename ~ '(?i)blake|jones'
)
select max(min_hiredate) as start,
       min(max_hiredate) as stop,
       count(*)          as business_days
from hiredates,
     generate_series(min_hiredate, max_hiredate, '1 day'::interval) as date
where to_char(date, 'day') !~ 'saturday|sunday';

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
1 rows affected.

[(datetime.date(2006, 4, 2), datetime.date(2006, 5, 1), 21)]

## 8.4 Determining the Number of Months or Years Between Two Dates

In [5]:
%%sql
with diff as (
    select min(hiredate)                     as min_hiredate,
           max(hiredate)                     as max_hiredate,
           age(max(hiredate), min(hiredate)) as diff
    from emp
)
select *,
       extract(years from diff) + extract(months from diff) / 12. as years,
       12. * extract(years from diff) + extract(months from diff) as months
from diff;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
1 rows affected.

[(datetime.date(2005, 12, 17), datetime.date(2008, 1, 12), datetime.timedelta(days=756), 2.0, 24.0)]

## 8.5 Determining the Number of Seconds, Minutes, or Hours Between Two Dates

In [6]:
%%sql
with diff as (
    select min(hiredate)                     as min_hiredate,
           max(hiredate)                     as max_hiredate,
           age(max(hiredate), min(hiredate)) as diff
    from emp
    where ename ~ '(?i)allen|ward'
)
select *,
       extract(epoch from diff)            as seconds,
       extract(epoch from diff) / 60.      as minutes,
       extract(epoch from diff) / 60. / 60 as hours
from diff;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
1 rows affected.

[(datetime.date(2006, 2, 20), datetime.date(2006, 2, 22), datetime.timedelta(days=2), 172800.0, 2880.0, 48.0)]

## 8.6 Counting the Occurrences of Weekdays in a Year

In [7]:
%%sql
select to_char(date, 'ID day') as day,
       count(*)                as count
from generate_series(date_trunc('year', now()),
                     date_trunc('year', now()) + '1 year - 1 day',
                     '1 day'::interval) as date
group by day
order by day;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
7 rows affected.

[('1 monday   ', 52),
 ('2 tuesday  ', 52),
 ('3 wednesday', 53),
 ('4 thursday ', 53),
 ('5 friday   ', 52),
 ('6 saturday ', 52),
 ('7 sunday   ', 52)]

## 8.7 Determining the Date Difference Between the Current Record and the Next Record

In [8]:
%%sql
select deptno,
       ename,
       hiredate,
       to_char(age(hiredate::timestamp, lag(hiredate) over (order by hiredate)),
               'FMmm "months" FMdd "days"') as hired_after
from emp
order by empno;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
14 rows affected.

[(20, 'SMITH', datetime.date(2005, 12, 17), None),
 (30, 'ALLEN', datetime.date(2006, 2, 20), '2 months 3 days'),
 (30, 'WARD', datetime.date(2006, 2, 22), '0 months 2 days'),
 (20, 'JONES', datetime.date(2006, 4, 2), '1 months 8 days'),
 (30, 'MARTIN', datetime.date(2006, 9, 28), '0 months 20 days'),
 (30, 'BLAKE', datetime.date(2006, 5, 1), '0 months 29 days'),
 (10, 'CLARK', datetime.date(2006, 6, 9), '1 months 8 days'),
 (20, 'SCOTT', datetime.date(2007, 12, 9), '10 months 17 days'),
 (10, 'KING', datetime.date(2006, 11, 17), '1 months 19 days'),
 (30, 'TURNER', datetime.date(2006, 9, 8), '2 months 29 days'),
 (20, 'ADAMS', datetime.date(2008, 1, 12), '1 months 3 days'),
 (30, 'JAMES', datetime.date(2006, 12, 3), '0 months 0 days'),
 (20, 'FORD', datetime.date(2006, 12, 3), '0 months 16 days'),
 (10, 'MILLER', datetime.date(2007, 1, 23), '1 months 20 days')]